20231126T004018--emacs-colors-in-tmux__emacs_tmux.org
#+title:      emacs colors in tmux
#+date:       [2023-11-26 Sun 00:40]
#+filetags:   :emacs:tmux:
#+identifier: 20231126T004018

Jeigu kartais noresi pasileisti emacs in tmux (shudas, kol kas neradau kaip
padaryti, kad galeciau close all headers in .org file), tai noresi tikriausiai
ir spalvas atitaikyti. By default jeigu per tmux paleidi =emacs -nw=, tuomet
buna shudinos spalvos.

Reikia sekti sita tutorial -
https://unix.stackexchange.com/questions/1045/getting-256-colors-to-work-in-tmux201

basically this:

#+begin_src bash
  ~$ which tmux
  tmux: aliased to TERM=xterm-256color tmux
  # and in in my .tmux.conf:

  set -g default-terminal "screen-256color"
  # Aliasing tmux to "tmux -2" should also do the trick.

  #And don't forget to restart your tmux server: (see @mast3r answer)
  tmux kill-server && tmux201
#+end_src
