html/20231126T004018--emacs-colors-in-tmux__emacs_tmux.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>emacs colors in tmux</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231126T004018--emacs-colors-in-tmux__emacs_tmux.html">emacs colors in tmux</a></h1>
<p>
Jeigu kartais noresi pasileisti emacs in tmux (shudas, kol kas neradau kaip
padaryti, kad galeciau close all headers in .org file), tai noresi tikriausiai
ir spalvas atitaikyti. By default jeigu per tmux paleidi <code>emacs -nw</code>, tuomet
buna shudinos spalvos.
</p>

<p>
Reikia sekti sita tutorial -
<a href="https://unix.stackexchange.com/questions/1045/getting-256-colors-to-work-in-tmux201">https://unix.stackexchange.com/questions/1045/getting-256-colors-to-work-in-tmux201</a>
</p>

<p>
basically this:
</p>

<div class="org-src-container">
<pre class="src src-bash">~$ which tmux
tmux: aliased to TERM=xterm-256color tmux
# and in in my .tmux.conf:

set -g default-terminal "screen-256color"
# Aliasing tmux to "tmux -2" should also do the trick.

#And don't forget to restart your tmux server: (see @mast3r answer)
tmux kill-server &amp;&amp; tmux201
</pre>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> <a href="https://arvydasg.github.io/devnotes/html/tag-tmux.html">tmux</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
